In [1]:
import numpy as np
import pandas as pd

In [2]:
pwd

'C:\\Users\\LENOVO\\python_For_ml\\Pandas'

In [3]:
ls

 Volume in drive C is Windows-SSD
 Volume Serial Number is 022C-477C

 Directory of C:\Users\LENOVO\python_For_ml\Pandas

04/04/2025  05:25 PM    <DIR>          .
04/02/2025  06:22 PM    <DIR>          ..
04/04/2025  05:20 PM    <DIR>          .ipynb_checkpoints
04/04/2025  01:50 PM            48,282 Combining_DataFrames.ipynb
04/02/2025  09:53 PM            69,017 Conditional Filtering.ipynb
04/02/2025  09:33 PM           129,762 DataFrames.ipynb
04/04/2025  05:25 PM             2,564 Data-Input-Output.ipynb
04/02/2025  07:26 PM                51 example.csv
04/02/2025  07:26 PM             5,022 example.xlsx
04/03/2025  01:49 PM            96,211 Group_By.ipynb
04/02/2025  07:26 PM        25,112,317 hotel_booking_data.csv
04/03/2025  12:48 PM            53,059 Missing_Data.ipynb
04/02/2025  07:26 PM               177 movie_scores.csv
04/02/2025  07:26 PM            17,727 mpg.csv
04/02/2025  07:26 PM             5,022 my_excel_file.xlsx
04/02/2025  07:26 PM                51 new_file.csv
04/02/2025  07:26 PM             5,021 new_workbook.xlsx
04/04/2025  04:22 PM                40 newfile.csv
04/02/2025  07:26 PM            52,132 reshaping_pivot.png
04/02/2025  07:26 PM             5,459 RetailSales_BeerWineLiquor.csv
04/02/2025  07:26 PM             1,320 Sales_Funnel_CRM.csv
04/02/2025  07:26 PM             1,330 sample_table.html
04/02/2025  07:27 PM             8,768 Series.ipynb
04/02/2025  07:26 PM               555 simple.html
04/04/2025  02:32 PM            11,414 Text_Methods.ipynb
04/04/2025  04:03 PM            18,725 TimeMethodsForDateAndTime.ipynb
04/02/2025  07:26 PM            18,752 tips.csv
04/03/2025  12:01 PM           145,831 UseFul_Methods.ipynb
              25 File(s)     25,808,609 bytes
               3 Dir(s)  124,562,239,488 bytes free

In [4]:
import os

In [5]:
os.getcwd()

'C:\\Users\\LENOVO\\python_For_ml\\Pandas'

In [6]:
df = pd.read_csv('example.csv',index_col=0) #header = None

In [7]:
df

     b   c   d
a
0    1   2   3
4    5   6   7
8    9  10  11
12  13  14  15

In [8]:
df.to_csv('newfile.csv',index = False)

In [9]:
new = pd.read_csv('new_file.csv')

In [10]:
new

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

# FROM HTML TABLES

In [11]:
url = "https://en.wikipedia.org/wiki/World_population"

In [12]:
tables = pd.read_html(url)

In [13]:
len(tables)

27

In [196]:
world_topten

    Year  Population Yearly growth           Density (pop/km2)
    Year  Population             %    Number Density (pop/km2)
0   1951  2543130380         1.75%  43808223                17
1   1952  2590270899         1.85%  47140519                17
2   1953  2640278797         1.93%  50007898                18
3   1954  2691979339         1.96%  51700542                18
4   1955  2746072141         2.01%  54092802                18
..   ...         ...           ...       ...               ...
68  2019  7764951032         1.06%  81161204                52
69  2020  7840952880         0.98%  76001848                53
70  2021  7909295151         0.87%  68342271                53
71  2022  7975105156         0.83%  65810005                54
72  2023  8045311447         0.88%  70206291                54

[73 rows x 5 columns]

In [153]:
world_topten=tables[8]

In [203]:
world_topten.columns = ['Year','Population','Yearly growth','Yearly number','Density (pop/km2)']

In [204]:
world_topten

    Year  Population Yearly growth  Yearly number  Density (pop/km2)
0   1951  2543130380         1.75%       43808223                 17
1   1952  2590270899         1.85%       47140519                 17
2   1953  2640278797         1.93%       50007898                 18
3   1954  2691979339         1.96%       51700542                 18
4   1955  2746072141         2.01%       54092802                 18
..   ...         ...           ...            ...                ...
68  2019  7764951032         1.06%       81161204                 52
69  2020  7840952880         0.98%       76001848                 53
70  2021  7909295151         0.87%       68342271                 53
71  2022  7975105156         0.83%       65810005                 54
72  2023  8045311447         0.88%       70206291                 54

[73 rows x 5 columns]

In [205]:
world_topten.to_html('sample_table.html')

In [206]:
### python use open pyxl and xlrd for xl file operations

In [210]:
df = pd.read_excel("my_excel_file.xlsx",sheet_name='First_Sheet')

In [211]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [212]:
wb = pd.ExcelFile("my_excel_file.xlsx")

In [213]:
wb.sheet_names

['First_Sheet']

In [215]:
excel_sheet_dict = pd.read_excel('my_excel_file.xlsx',sheet_name=None)

In [216]:
type(excel_sheet_dict)

dict

In [217]:
excel_sheet_dict.keys()

dict_keys(['First_Sheet'])

In [221]:
our_df = excel_sheet_dict['First_Sheet']

In [223]:
excel_sheet_dict

{'First_Sheet':     a   b   c   d
 0   0   1   2   3
 1   4   5   6   7
 2   8   9  10  11
 3  12  13  14  15}

In [222]:
our_df.to_excel('example.xlsx',sheet_name='First_Sheet',index=False)

## FROM SQL

In [224]:
from sqlalchemy import create_engine

In [225]:
temp_db = create_engine('sqlite:///:memory:')

In [227]:
df = pd.DataFrame(data = np.random.randint(low=0,high=100,size=(4,4)),columns=['a','b','c','d'])

In [228]:
df

    a   b   c   d
0  62  28  22  64
1  23  13  27  67
2  66   9  16  51
3  26  66  63  74

In [235]:
df.to_sql(name='new_table',con=temp_db,if_exists='replace',index=False)

4

In [236]:
new_df = pd.read_sql(sql = 'new_table',con=temp_db)

In [237]:
new_df

    a   b   c   d
0  62  28  22  64
1  23  13  27  67
2  66   9  16  51
3  26  66  63  74

In [238]:
pd.read_sql_query(sql = "SELECT a,c FROM new_table",con=temp_db)

    a   c
0  62  22
1  23  27
2  66  16
3  26  63

In [ ]:
\